In [6]:
import pandas as pd

In [7]:
data = ([["mayur", 21], ["suraj", 22], ["vishwas", 20]]) # By List
data

[['mayur', 21], ['suraj', 22], ['vishwas', 20]]

In [8]:
df = pd.DataFrame(data, columns = ["Names", "Age"]) # The list in Pandas
df

     Names  Age
0    mayur   21
1    suraj   22
2  vishwas   20

In [9]:
dic = {"a": [1, 2, 3], "b": [4, 5, 6]} # The dictionary 
dic

{'a': [1, 2, 3], 'b': [4, 5, 6]}

In [10]:
df1 = pd.DataFrame(dic) # Thedictionary in Pandas
df1

   a  b
0  1  4
1  2  5
2  3  6

In [11]:
import numpy as np

In [12]:
arr = np.array([[1,2], [3, 4]]) # The NumPy array
arr

array([[1, 2],
       [3, 4]])

In [13]:
df = pd.DataFrame(arr, columns = ['A', 'B']) # By using Pandas
df

   A  B
0  1  2
1  3  4

In [14]:
### File reading from .xlsx (Excel)

df = pd.read_excel("Book1.xlsx") 
df

       Names     School  Age
0      Names       BMIT   21
1      Names  DY PATIIL   22
2      Names        SPM   20
3      Names        SPD   21
4      Names        SPS   20
5      Names         AS   14
6      Names       ASJR   17
7  Sanjivani       ASJR   16

In [15]:
### File reading from .csv

df2 = pd.read_csv("Book2.csv")
df2

       Names     School  Age
0      Names       BMIT   21
1      Names  DY PATIIL   22
2      Names        SPM   20
3      Names        SPD   21
4      Names        SPS   20
5      Names         AS   14
6      Names       ASJR   17
7  Sanjivani       ASJR   16

In [16]:
### Read  from .json

df3 = pd.read_json("Book3.json")
df3

    name    lang
0  Mayur  python
1  Suraj    Java

In [17]:
### Read from URL

url = "https://raw.githubusercontent.com/mwaskom/seaborn-data/master/tips.csv"

df4 = pd.read_csv(url)
df4 # Oh my god the bills are too large but when you work as a Data Scientist it just like an üêú üòÇ

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [18]:
### EDA - Exploratory Data Analysis

In [19]:
df4.head() # It gives 1st 5-rows

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [20]:
df4.tail() # Last 5-rows

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [21]:
df4.describe().round(2)

       total_bill     tip    size
count      244.00  244.00  244.00
mean        19.79    3.00    2.57
std          8.90    1.38    0.95
min          3.07    1.00    1.00
25%         13.35    2.00    2.00
50%         17.80    2.90    2.00
75%         24.13    3.56    3.00
max         50.81   10.00    6.00

In [22]:
df4.info() # Gives info about entire datasheet

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [23]:
df4.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [24]:
df4.shape # rows x columns

(244, 7)